app/controllers/posts_controller.rb

INSERT INTO "posts" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@post = Post.create(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 49]]
UPDATE "posts" SET "caption" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["caption", "Updated post"], ["updated_at", "2016-05-30 15:51:58.029832"], ["id", 49]]
---
	def update
		@post = Post.find(params[:id])
		@post.update(post_params)